#include "Main.h"
#include "Game.h"
#include "Ground.h"

//---------------------------------------------------------------------------------
//	èâä˙âªèàóù
//---------------------------------------------------------------------------------
void Ground::Init( int model )
{
    this->model = model;

    this->pos.clear();
    this->rot.clear();
}
//---------------------------------------------------------------------------------
//	çXêVèàóù
//---------------------------------------------------------------------------------
void Ground::Update()
{
}
//---------------------------------------------------------------------------------
//	ï`âÊèàóù
//---------------------------------------------------------------------------------
void Ground::Render()
{
    /*MV1SetPosition( this->model, VGet( this->pos.x, this->pos.y, this->pos.z ) );
	MV1SetRotationXYZ( this->model, VGet( TO_RADIAN( this->rot.x ), TO_RADIAN( this->rot.y ), TO_RADIAN( this->rot.z ) ) );
	MV1DrawModel( this->model );*/

    DrawLine3D( VGet( -50.0f, 0.0f, 0.0f ), VGet( 50.0f, 0.0f, 0.0f ), GetColor( 255, 0, 0 ) );
    DrawLine3D( VGet( 0.0f, 0.0f, -50.0f ), VGet( 0.0f, 0.0f, 50.0f ), GetColor( 0, 0, 255 ) );
}
//---------------------------------------------------------------------------------
//	èIóπèàóù
//---------------------------------------------------------------------------------
void Ground::Exit()
{
}
