#include "Main.h"
#include "Game.h"
#include "Random.h"
#include "Npc.h"

#define NPC_MOV_SPEED	0.05f
#define NPC_ROT_SPEED	0.3f

//---------------------------------------------------------------------------------
//	èâä˙âªèàóù
//---------------------------------------------------------------------------------
void Npc::Init( int model )
{
	model_ = model;

	pos_.x = -5.0f;
	pos_.y = 10.0f;
	rot_.y = 90.0f;

	radius_ = 0.5f;
}
//---------------------------------------------------------------------------------
//	çXêVèàóù
//---------------------------------------------------------------------------------
void Npc::Update()
{
	rot_.y += NPC_ROT_SPEED;

	pos_.x += NPC_MOV_SPEED * sinf( TO_RADIAN( rot_.y ) );
	pos_.y += NPC_MOV_SPEED * cosf( TO_RADIAN( rot_.y ) );
}
//---------------------------------------------------------------------------------
//	ï`âÊèàóù
//---------------------------------------------------------------------------------
void Npc::Render()
{
	// MV1SetPosition( model_, VGet( pos_.x, pos_.y, pos_.y ) );
	// MV1SetRotationXYZ( model_, VGet( TO_RADIAN( rot_.x ), TO_RADIAN( rot_.y ), TO_RADIAN( rot_.z ) ) );
	// MV1DrawModel( model_ );
}
//---------------------------------------------------------------------------------
//	èIóπèàóù
//---------------------------------------------------------------------------------
void Npc::Exit()
{
}
