#include "Main.h"
#include "Game.h"
#include "Random.h"
#include "Base.h"
#include "Player.h"
#include "Npc.h"



Npc::Npc( int image ) : Player( image )
{
    deck = std::make_unique<Deck>( 0 );
    hand = std::make_unique<Hand>( 0 );
}
//---------------------------------------------------------------------------------
//	‰Šú‰»ˆ—
//---------------------------------------------------------------------------------
void Npc::Init()
{
    deck->Init();
}
//---------------------------------------------------------------------------------
//	XVˆ—
//---------------------------------------------------------------------------------
void Npc::Update( uint16_t turn )
{
    switch ( turn )
    {
        case DEAL_TURN :
            uint16_t num = hand->GetHandNum();
            if ( num < HAND_MAX )
            {
                hand->Draw( deck->Deal( HAND_MAX - num ) );
            }
            break;
    }
}
//---------------------------------------------------------------------------------
//	•`‰æˆ—
//---------------------------------------------------------------------------------
void Npc::Render()
{
    deck->Render();
    hand->Render(false);
}
//---------------------------------------------------------------------------------
//	I—¹ˆ—
//---------------------------------------------------------------------------------
void Npc::Release()
{
}

void Npc::SelectCard( CardBase card )
{
}
